CSI API ETABS v1
cTower.DeleteTower Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int DeleteTower(
	string TowerName,
	bool Associate,
	string AssocWithTower = ""
)
Function DeleteTower (
	TowerName As String,
	Associate As Boolean,
	Optional AssocWithTower As String = ""
) As Integer
Dim instance As cTower
Dim TowerName As String
Dim Associate As Boolean
Dim AssocWithTower As String
Dim returnValue As Integer
returnValue = instance.DeleteTower(TowerName,
	Associate, AssocWithTower)
int DeleteTower(
	String^ TowerName,
	bool Associate,
	String^ AssocWithTower = L""
)
abstract DeleteTower :
        TowerName : string *
        Associate : bool *
        ?AssocWithTower : string
(* Defaults:
        let _AssocWithTower = defaultArg AssocWithTower ""
*)
-> int
Parameters
TowerName
Type: System.String
Associate
Type: System.Boolean
AssocWithTower (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cTower Interface
ETABSv1 Namespace